archives/2024/Results/Verifications/S2427/update_index/tidb-server-xuantie-rv64imafdcv0p7_zfh_xtheadc.sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 12
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 12 tps: 2779.40 qps: 2779.40 (r/w/o: 0.00/2710.63/68.77) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 12 tps: 2804.29 qps: 2804.29 (r/w/o: 0.00/2730.69/73.60) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 12 tps: 2719.02 qps: 2719.02 (r/w/o: 0.00/2652.92/66.10) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 12 tps: 2459.69 qps: 2459.69 (r/w/o: 0.00/2397.39/62.30) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 12 tps: 2610.80 qps: 2610.80 (r/w/o: 0.00/2547.00/63.80) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 12 tps: 2707.42 qps: 2707.42 (r/w/o: 0.00/2640.32/67.10) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 12 tps: 2552.58 qps: 2552.58 (r/w/o: 0.00/2490.78/61.80) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 12 tps: 2779.52 qps: 2779.52 (r/w/o: 0.00/2711.12/68.40) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 12 tps: 2843.28 qps: 2843.28 (r/w/o: 0.00/2773.18/70.10) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 12 tps: 2724.72 qps: 2724.72 (r/w/o: 0.00/2654.32/70.40) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 12 tps: 2864.68 qps: 2864.68 (r/w/o: 0.00/2788.58/76.10) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 12 tps: 2831.82 qps: 2831.82 (r/w/o: 0.00/2759.82/72.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 12 tps: 2807.28 qps: 2807.28 (r/w/o: 0.00/2740.28/67.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 12 tps: 2896.40 qps: 2896.40 (r/w/o: 0.00/2831.20/65.20) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 12 tps: 2844.12 qps: 2844.12 (r/w/o: 0.00/2771.82/72.30) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 12 tps: 2861.38 qps: 2861.38 (r/w/o: 0.00/2792.68/68.70) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 12 tps: 2834.80 qps: 2834.80 (r/w/o: 0.00/2765.20/69.60) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 12 tps: 2798.91 qps: 2798.91 (r/w/o: 0.00/2730.71/68.20) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 12 tps: 2710.59 qps: 2710.59 (r/w/o: 0.00/2640.29/70.30) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 12 tps: 2582.70 qps: 2582.70 (r/w/o: 0.00/2521.60/61.10) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 12 tps: 2828.81 qps: 2828.81 (r/w/o: 0.00/2758.61/70.20) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 12 tps: 2638.19 qps: 2638.19 (r/w/o: 0.00/2577.89/60.30) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 12 tps: 2344.10 qps: 2344.20 (r/w/o: 0.00/2289.00/55.20) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 12 tps: 2707.22 qps: 2707.12 (r/w/o: 0.00/2638.92/68.20) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 12 tps: 2861.58 qps: 2861.58 (r/w/o: 0.00/2792.58/69.00) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 12 tps: 2709.62 qps: 2709.62 (r/w/o: 0.00/2636.82/72.80) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 12 tps: 2731.89 qps: 2731.89 (r/w/o: 0.00/2666.99/64.90) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 12 tps: 2780.69 qps: 2780.69 (r/w/o: 0.00/2711.79/68.90) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 12 tps: 2790.00 qps: 2790.00 (r/w/o: 0.00/2721.00/69.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 12 tps: 2750.22 qps: 2750.22 (r/w/o: 0.00/2685.62/64.60) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 12 tps: 2803.98 qps: 2803.98 (r/w/o: 0.00/2733.48/70.50) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 12 tps: 2811.22 qps: 2811.22 (r/w/o: 0.00/2743.02/68.20) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 12 tps: 2860.10 qps: 2860.10 (r/w/o: 0.00/2789.20/70.90) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 12 tps: 2837.28 qps: 2837.28 (r/w/o: 0.00/2766.68/70.60) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 12 tps: 2783.50 qps: 2783.50 (r/w/o: 0.00/2715.50/68.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 12 tps: 2701.62 qps: 2701.62 (r/w/o: 0.00/2638.52/63.10) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 12 tps: 2767.38 qps: 2767.38 (r/w/o: 0.00/2698.88/68.50) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 12 tps: 2757.30 qps: 2757.30 (r/w/o: 0.00/2688.90/68.40) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 12 tps: 2371.61 qps: 2371.61 (r/w/o: 0.00/2310.21/61.40) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 12 tps: 2316.77 qps: 2316.77 (r/w/o: 0.00/2264.07/52.70) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 12 tps: 2561.38 qps: 2561.38 (r/w/o: 0.00/2500.48/60.90) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 12 tps: 2757.78 qps: 2757.78 (r/w/o: 0.00/2696.38/61.40) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 12 tps: 2727.18 qps: 2727.18 (r/w/o: 0.00/2656.08/71.10) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 12 tps: 2938.63 qps: 2938.63 (r/w/o: 0.00/2864.43/74.20) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 12 tps: 2884.69 qps: 2884.69 (r/w/o: 0.00/2816.29/68.40) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 12 tps: 2859.13 qps: 2859.13 (r/w/o: 0.00/2791.64/67.50) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 12 tps: 2796.72 qps: 2796.72 (r/w/o: 0.00/2725.02/71.70) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 12 tps: 2821.26 qps: 2821.26 (r/w/o: 0.00/2752.75/68.50) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 12 tps: 2846.82 qps: 2846.82 (r/w/o: 0.00/2777.82/69.00) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 12 tps: 2804.39 qps: 2804.39 (r/w/o: 0.00/2736.49/67.90) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 12 tps: 2697.92 qps: 2697.92 (r/w/o: 0.00/2635.72/62.20) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 12 tps: 2892.00 qps: 2892.00 (r/w/o: 0.00/2820.60/71.40) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 12 tps: 2506.30 qps: 2506.30 (r/w/o: 0.00/2444.10/62.20) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 12 tps: 2522.30 qps: 2522.30 (r/w/o: 0.00/2460.30/62.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 12 tps: 2599.21 qps: 2599.21 (r/w/o: 0.00/2531.71/67.50) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 12 tps: 2832.89 qps: 2832.89 (r/w/o: 0.00/2760.99/71.90) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 12 tps: 2680.20 qps: 2680.20 (r/w/o: 0.00/2618.30/61.90) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 12 tps: 2836.51 qps: 2836.51 (r/w/o: 0.00/2764.01/72.50) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 12 tps: 2845.89 qps: 2845.89 (r/w/o: 0.00/2779.79/66.10) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 12 tps: 2731.14 qps: 2731.14 (r/w/o: 0.00/2665.54/65.60) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1602792
        other:                           40322
        total:                           1643114
    transactions:                        1643114 (2738.49 per sec.)
    queries:                             1643114 (2738.49 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0063s
    total number of events:              1643114

Latency (ms):
         min:                                    1.13
         avg:                                    4.38
         max:                                  253.26
         95th percentile:                        7.56
         sum:                              7196988.72

Threads fairness:
    events (avg/stddev):           136926.1667/169.34
    execution time (avg/stddev):   599.7491/0.00